# UsesRegionRendering Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..UsesRegionRendering Property
RenderingSettings Class See Also
---
The bool value that indicates whether to use region rendering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool UsesRegionRendering { get; set; }
```

Visual Basic
---
```text
Public Property UsesRegionRendering As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UsesRegionRendering {
	bool get ();
	void set (bool value);
}
```

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace